Revit 2027 API
OverrideGraphicSettings.SurfaceForegroundPatternColor Property
 The override color of the surface foreground pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color SurfaceForegroundPatternColor { get; }
Public ReadOnly Property SurfaceForegroundPatternColor As Color
	Get
public:
property Color^ SurfaceForegroundPatternColor {
	Color^ get ();
}
member SurfaceForegroundPatternColor : Color with get
Property Value
Color
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace